app/Controllers/Tickets.php

    public function index()
    {
        $model = new TicketsModel();
        $data = $model->findAll();
---
SELECT *
FROM `tickets`

    public function show($id = null)
    {
        $model = new TicketsModel();
        $data = $model->getWhere(['id' => $id])->getResult();
---
SELECT *
FROM `tickets`
WHERE `id` = '18'

    public function delete($id = null)
    {
        $model = new TicketsModel();
        $data = $model->find($id);
        if($data){
            $model->delete($id);
---
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '12'
DELETE FROM `tickets`
WHERE `id` IN ('12')